app/controllers/movies_controller.rb

  def index
    type = params[:type] #get movie type from URI route
    ratings = params[:ratings] #get movie ratings from URI route
    session_ratings = session[:ratings]
    @all_ratings = ['G', 'PG','PG-13', 'R']
    if ratings.nil?
    	if session_ratings.nil?
    		keys = @all_ratings
    	else
    		keys = session_ratings
    	end
    else
    	keys = ratings.keys
    end
    @selected_ratings = keys
    @movies = Movie.all.find_all{|movie| @selected_ratings.include? movie.rating]}
---
SELECT "movies".* FROM "movies"